
[Support_Air_Offensive_StrafingRun_A10_T1 X2WeaponTemplate]
FriendlyName="Fire Support: A10 Strafing Run"
FriendlyNamePlural="Fire Support: A10 Strafing Run"
BriefSummary="A radio with its frequency set to call in fire support at the designated area."
TacticalText="<Bullet/>A radio set that's specifically tuned to call in a specific fire support.\n<Bullet/>A10 Strafing Run: An A10 is called and performs a strafing run at the specified target area.\n<Bullet/>Deadly Accurate.\n<Bullet/>Cannot be used underground or inside massive buildings or building complexes."
AbilityDescName="support strike"


[Ability_Support_Air_Off_StrafingRun_A10_Stage1 X2AbilityTemplate]
LocFriendlyName="Request Strike: A10 Strafing Run"
LocLongDescription="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\nRequests delayed Strafing Run given a vector and direction. An A10 will perform a strafing run after several turns."
LocHelpText="<Ability:STRIKE_INTELCOST_USAGE_DYN/>\nDelayed Reinforcments at the requested sight."
LocFlyOverText="Support requested: Heli Drop In"

[Ability_Support_Air_Off_StrafingRun_Stage1_SelectAngle X2AbilityTemplate]
LocFriendlyName="Request Strike: A10 Strafing Run [Angle]"

